       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-PROJECT.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           STOP RUN.
